[
	{
		"class": "pink primrose",
		"description": "pink primrose is a herbaceous perennial wildflower. It has glabrous (smooth) to pubescent stems that grow to 50 centimetres (20 inches) in height. The pubescent leaves are alternate with very short or no petiole (sessile), reaching 10 cm (4 in) long to 4 cm (1+1⁄2 in) broad. They are variable in shape, from linear to obovate, and are toothed or wavy-edged. It produces single, four-petaled, cup-shaped flowers on the upper leaf axils. These fragrant shell-pink flowers bloom throughout the summer into early autumn. The 4–5 cm (1+1⁄2–2 in) flowers start out white and turn pink as they ag"
	},
	{
		"class": "hard-leaved pocket orchid",
		"description": " hard-leaved pocket orchid described in 1951, is commonly known as the silver slipper orchid or hard-leaved pocket orchid. It blooms during late winter to early summer with one flower per inflorescence. As opposed to its close sibling Paph. malipoense, the flowers of Paph. micranthum have no fragrance. "
	},
	{
		"class": "canterbury bells",
		"description": "Campanula medium reaches approximately 60–80 cm (24–31 in) in height. This biennial herbaceous plant forms rosettes of leaves in the first year, stems and flowers in the second one. The stem is erect, robust, reddish-brown and bristly hairy. The basal leaves are stalked and lanceolate to elliptical and 12–15 cm (5–6 in) long with serrated leaf edge. The upper leaves are smaller, lanceolate and sessile, almost embracing the stem.  The flowers are arranged in a racemose inflorescence of extremely long-lasting blooms. These attractive bell-shaped flowers are short-stalked, large and hermaphroditic, with different shades of violet-blue or rarely white. The corolla has five fused petals with lightly bent lobes (known as a coronate flower type).  The flowering period extends from May to July in the Northern Hemisphere. The flowers are either self-fertilized (autogamy) or pollinated by insects such as bees and butterflies (entomogamy).[1] The seeds ripen from August to September and are dispersed by gravity alone (barochory). "
	},
	{
		"class": "sweet pea",
		"description": "Sweet pea flowers are known for their vibrant colors, attractive fragrance, and climbing habit. They typically feature clusters of pea-like blossoms in various hues, including white, pink, red, purple, and blue. These annual plants, scientifically known as Lathyrus odoratus, can grow up to 6-8 feet tall when provided with support, and their fragrant flowers are a popular choice for bouquets and floral arrangements"
	},
	{
		"class": "english marigold",
		"description": "Calendula officinalis is a short-lived aromatic herbaceous perennial, growing to 80 cm (31 in) tall, with sparsely branched lax or upright stems. The leaves are oblong-lanceolate, 5–17 cm (2–7 in) long, hairy on both sides, and with margins entire or occasionally waved or weakly toothed.  The inflorescences are yellow or orange, comprising a thick capitulum or flowerhead 4–7 cm (1+1⁄2–3 in) diameter surrounded by two rows of hairy bracts. In the wild plant they have a single ring of ray florets surrounding the central disc florets. The disc florets are tubular and hermaphroditic, and generally of a more intense orange-yellow color than the female, tridentate, peripheral ray florets. The flowers may appear all year long where conditions are suitable. The fruit is a thorny curved achene. "
	},
	{
		"class": "tiger lily",
		"description": "Like other true lilies, the flowers are borne on upright stems that are 80–200 centimetres (31–79 inches) tall and bear lanceolate leaves 6–10 cm (2+1⁄2–4 in) long and 1–2 cm (3⁄8–3⁄4 in) broad. L. lancifolium produces aerial bulblets, known as bulbils, in the leaf axils. These bulbils are uncommon in Lilium species and they produce new plants that are clones of the original plant. The flowers are odorless. Each lasts a few days and if pollinated produce capsules with many thin seeds. Extrafloral nectaries on the species were first noted by Zimmerman 1932. "
	},
	{
		"class": "moon orchid",
		"description": "Phalaenopsis  amabilis is an epiphytic, rarely lithophytic herb with coarse, flattened, branching roots up to 1 metre (3.3 ft) long and usually 3–4 millimetres (0.12–0.16 in) wide. Between two and eight fleshy, dark green, oblong to egg-shaped leaves 150–300 millimetres (5.9–12 in) long and 40–70 millimetres (1.6–2.8 in) wide are arranged in two rows along the stem. The stem is 100–300 millimetres (3.9–12 in) but hidden by the leaf bases. The flowers are arranged on a stiff, arching flowering stem 300–750 millimetres (12–30 in) long emerging from a leaf base, with a few branches near the tip. Each branch of the flowering stem bears between two and ten white, long-lasting flowers on a stalk (including the ovary) 20–35 millimetres (0.79–1.4 in) long. Each flower is 60–70 millimetres (2.4–2.8 in) long and 50–80 millimetres (2.0–3.1 in) wide with the sepals and petals free from and spreading widely apart from each other. The sepals are egg-shaped, 30–40 millimetres (1.2–1.6 in) long and about 20 millimetres (0.79 in) wide and the petals broadly egg-shaped to almost square, 30–40 millimetres (1.2–1.6 in) long and wide. The labellum is white with yellow and reddish markings, about 25 millimetres (0.98 in) long with three lobes. The side lobes curve upwards and partly surround the column. The middle lobe is cross-shaped with a rounded tip and two long, thread-like wavy arms. There is a large yellow callus near the base of the labellum. Flowering time depends on distribution but occurs from April to December in New Guinea.[10][11][12] "
	},
	{
		"class": "bird of paradise",
		"description": "The species S. nicolai is the largest in the genus, reaching 10 m (33 ft) tall, with stately white and blue flowers;[8] the other species typically reach 2.0 to 3.5 m (6 ft 7 in to 11 ft 6 in) tall, except S. caudata, which is a tree of a typically smaller size than S. nicolai.  The leaves are large, 30 to 200 cm (1 ft 0 in to 6 ft 7 in) long and 10 to 80 cm (3.9 in to 2 ft 7.5 in) broad, similar to a banana leaf in appearance, but with a longer petiole, and arranged strictly in two ranks to form a fan-like crown of evergreen foliage.  The flowers are produced in a horizontal inflorescence emerging from a stout spathe. "
	},
	{
		"class": "monkshood",
		"description": "The dark green leaves of Aconitum species lack stipules. They are palmate or deeply palmately lobed with five to seven segments. Each segment again is trilobed with coarse sharp teeth. The leaves have a spiral (alternate) arrangement. The lower leaves have long petioles.  Dissected flower of Aconitum vulparia, showing the nectaries The tall, erect stem is crowned by racemes of large blue, purple, white, yellow, or pink zygomorphic flowers with numerous stamens. They are distinguishable by having one of the five petaloid sepals (the posterior one), called the galea, in the form of a cylindrical helmet, hence the English name monkshood.[4] Two to 10 petals are present. The two upper petals are large and are placed under the hood of the calyx and are supported on long stalks. They have a hollow spur at their apex, containing the nectar. The other petals are small and scale-like or nonforming. The three to five carpels are partially fused at the base. "
	},
	{
		"class": "globe thistle",
		"description": "The capitulas are single-flowered, have a hermaphrodite tubular flower and are surrounded by a multi-rowed sheath. Numerous capitulas form spherical inflorescences of the second order, which have a diameter of 4 to 8 centimeters. The capitulas bloom from top to bottom within a head. The corolla is tubular, divided almost to the base. The flower color is steel blue to white, the inflorescences as a whole are usually bluish. The stamens are blue-gray. The achenes are cylindrical, pentagonal and hairy. The pappus has short scales."
	},
	{
		"class": "snapdragon",
		"description": "Snapdragons (Antirrhinum majus) are known for their unique, dragon-shaped flowers that come in a variety of colors and are arranged in tall spikes. These flowers are tubular, bilaterally symmetrical, and feature a snap when squeezed, resembling a dragon's mouth. They are popular in gardens and floral arrangements, prized for their vibrant hues and interesting shape"
	},
	{
		"class": "colt's foot",
		"description": "Coltsfoot is a perennial herbaceous plant that spreads by seeds and rhizomes. Tussilago is often found in colonies of dozens of plants. The flowers, which superficially resemble dandelions, bear scale-leaves on the long stems in early spring. The leaves of coltsfoot, which appear after the flowers have set seed, wither and die in the early summer. The flower heads are of yellow florets with an outer row of bracts. The plant is typically 10–30 cm (3.9–11.8 in) in height. The leaves have angular teeth on their margins.[6][7]"
	},
	{
		"class": "king protea",
		"description": "Protea cynaroides, also called the king protea (from Afrikaans: koningsprotea, Xhosa: isiQwane sobukumkani[3]), is a flowering plant. It is a distinctive member of Protea, having the largest flower head in the genus. The species is also known as giant protea, honeypot, or king sugar bush. It is widely distributed in the fynbos region of South Africa, that is, in the southwestern and southern parts of Western Cape. The king protea is the national flower of South Africa.Protea cynaroides is adapted to survive wildfires by its thick underground stem, which contains many dormant buds; these will produce the new growth after the fire. The flower has a long vase life in flower arrangements, and makes for an excellent dried flower. "
	},
	{
		"class": "spear thistle",
		"description": "It is a tall biennial or short-lived monocarpic thistle, forming a rosette of leaves and a taproot up to 70 cm (28 in) long in the first year, and a flowering stem 1–1.5 m (3 ft 4 in – 4 ft 11 in) tall in the second (rarely third or fourth) year. It can grow up to 1.8 metres (5 ft 11 in) tall.[12] It sometimes will function as an annual, flowering in the first year. The stem is winged, with numerous longitudinal spine-tipped wings along its full length. The leaves are stoutly spined, grey-green, deeply lobed; the basal leaves grow up to 30 centimetres (12 in) long,[12] with smaller leaves on the upper part of the flower stem; the leaf lobes are spear-shaped (from which the English name derives). The inflorescence is 2.5–5 centimetres (0.98–1.97 in) diameter, pink-purple, with all the florets of similar form (no division into disc and ray florets). The seeds are 5 millimetres (0.20 in) long, with a downy pappus, which assists in wind dispersal. As in other species of Cirsium (but unlike species in the related genus Carduus), the pappus hairs are feathery with fine side hairs.[13][14]"
	},
	{
		"class": "yellow iris",
		"description": "This herbaceous flowering perennial plant grows to 100–150 cm (39–59 in), or a rare 2 m (6 ft 7 in) tall, with erect leaves up to 90 cm (35 in) long and 3 cm (1.2 in) broad. The flowers are bright yellow, 7–10 cm (2.8–3.9 in) across, with the typical iris form. The fruit is a dry capsule 4–7 cm (1.6–2.8 in) long, containing numerous pale brown seeds. "
	},
	{
		"class": "globe-flower",
		"description": "Species of the genus Trollius are mostly herbaceous, fibrous rooted perennials with bright yellow, orange or lilac coloured flowers. The name globe flower refers to the petals of T. europaeus and T. × cultorum which are curved over the top of the flower, forming a globe. But T. pumilus has flatter flowers, and T. chinensis has open flowers with prominent stamens.[4]"
	},
	{
		"class": "purple coneflower",
		"description": "Echinacea purpurea is an herbaceous perennial up to 120 centimeters (47 inches) tall by 25 cm (10 in) wide at maturity. Depending on the climate, it blooms throughout summer into autumn. Its cone-shaped flowering heads are usually, but not always, purple in the wild. Its individual flowers (florets) within the flower head are hermaphroditic, having both male and female organs in each flower. It is pollinated by butterflies and bees. The alternate leaves, borne by a petiole from 0 to 17 cm (0 to 7 in), are oval to lanceolate, 5–30 cm (2–12 in) long by 5–12 cm (2–5 in) wide; the margin is tightened to toothed.The inflorescence is a capitulum, 7 to 15 cm (3 to 6 in) in diameter, formed by a prominent domed central protuberance consisting of multiple small yellow florets. These are surrounded by a ring of pink or purple ligulate florets. The tubular florets are hermaphrodite while the ligular florets are sterile. The involucral bracts are linear to lanceolate. The plant prefers well-drained soils in full sun.[4] The fruit is an achene, sought after by birds. "
	},
	{
		"class": "peruvian lily",
		"description": "Plants of this genus grow from a cluster of tubers. They send up fertile and sterile stems, the fertile stems of some species reaching 1.5 meters (4.9 feet) in height. The leaves are alternately arranged and resupinate, twisted on the petioles so that the undersides face up. The leaves are variable in shape and the blades have smooth edges. The flowers are solitary or borne in umbels. The flower has six petals each up to 5 centimeters (2.0 inches) long. They come in many shades of red, orange, yellow, green, purple, pink, and white, flecked and striped and streaked with darker colors. There are six curving stamens. The stigma has three lobes. The fruit is a capsule with three valves. Alstroemeria are classified as an inferior monocot, meaning the petals are located above the ovary and the leaf veins are parallel.[3]"
	},
	{
		"class": "balloon flower",
		"description": "Growing to 60 cm (24 in) tall by 30 cm (12 in) wide, it is an herbaceous perennial with dark green leaves and blue flowers in late summer. A notable feature of the plant is the flower bud, which swells like a balloon before fully opening.[4] The five petals are fused together into a bell shape at the base, like its relatives, the campanulas. "
	},
	{
		"class": "giant white arum lily",
		"description": "Zantedeschia aethiopica is a rhizomatous herbaceous perennial plant, evergreen where rainfall and temperatures are adequate, deciduous where there is a dry season. Its preferred habitat is in or on the banks of streams and ponds. It grows to 0.6–1 m (2.0–3.3 ft) tall, with large clumps of broad, arrow shaped dark green leaves up to 45 cm (18 in) long. The inflorescences are large and are produced in spring, summer and autumn, with a pure white spathe up to 25 cm (9.8 in) and a yellow spadix up to 9 cm (3+1⁄2 in) long.[3] The spadix produces a faint, sweet fragrance.[4] "
	},
	{
		"class": "fire lily",
		"description": "The fire lily produces tubular pink to bright red flowers.[3] Each tepal has a darker strip down the middle.[2] These are borne in an inflorescence containing 1-14 individual flowers.[2][4] Rarely, a plant will produce two inflorescences.[4] Flowers are most common from December to May, but are only produced after fires, stimulated by the smoke.[5] The flat, black seeds have wings and are dispersed by the wind.[2] The bulbs produce linear leaves every winter (June-August).[2] The leaves and flowers are not present at the same time. "
	},
	{
		"class": "pincushion flower",
		"description": "Pincushion flowers, scientifically known as Scabiosa, are known for their distinctive, cushion-like blooms that resemble a pincushion filled with pins. These flowers, often purple, pink, white, or burgundy, are characterized by a central dome of tiny florets surrounded by a ring of larger, more prominent petals. The genus encompasses about 80 species of annuals, biennials, and perennials, with many varieties grown as garden ornamentals"
	},
	{
		"class": "fritillary",
		"description": "Fritillaria is a genus of perennial herbaceous bulbiferous geophytes, dying back after flowering to an underground storage bulb from which they regrow in the following year.[3] It is characterised by nodding (pendant) flowers, perianths campanulate (bell- or cup-shaped) with erect segments in upper part, a nectarial pit, groove or pouch at the base of the tepal, anthers usually pseudobasifixed, rarely versatile, fruit sometimes winged, embryo minute.[4] "
	},
	{
		"class": "red ginger",
		"description": "Red ginger, scientifically known as Alpinia purpurata, is a vibrant tropical plant prized for its striking red, cone-shaped bracts (modified leaves) that surround small, inconspicuous white flowers. It's native to Southeast Asia and the Pacific Islands. The plant itself is an evergreen perennial, growing from rhizomes (underground stems) and reaching heights of 3-8 feet (0.9-2.4 meters). While the bracts are the main attraction, the plant also features large, glossy green leaves"
	},
	{
		"class": "grape hyacinth",
		"description": "Grape hyacinths (Muscari) are small, bulbous perennials known for their early spring blooms of dense, fragrant, bell-shaped, blue flowers that resemble upside-down bunches of grapes. These plants are native to Southeastern Europe and Asia Minor and are popular garden ornamentals, known for naturalizing easily. They feature long, narrow, grass-like leaves and are relatively low-maintenance, thriving in well-drained soil and full sun to partial shade"
	},
	{
		"class": "corn poppy",
		"description": "The corn poppy, scientifically known as Papaver rhoeas, is an annual plant characterized by its vibrant red, four-petaled flowers, often with a black blotch at the base of each petal. Native to Europe and Asia, it's now naturalized in many other regions, including parts of the U.S. Typically growing to about 9-18 inches tall, it features bristly-hairy stems and coarsely-toothed leaves. The flowers bloom from late spring to mid-summer, and the plant is known for its ability to form a long-lived seed bank"
	},
	{
		"class": "prince of wales feathers",
		"description": "Prince of Wales feathers, also known as Prince's feather, refers to the showy, feathery, and erect inflorescences (flower clusters) of the plant Amaranthus hypochondriacus. These flowers are typically deep red, purple, or beet-red, though some varieties may have yellowish or greenish hues. The inflorescences can be impressive in size, reaching up to 2 feet (60 cm) in height. The plant itself is an annual or short-lived perennial known for its vibrant, ornamental flowers and edible leaves and seeds"
	},
	{
		"class": "stemless gentian",
		"description": "Gentian have showy, dark blue flowers that bloom late spring to early summer. Gentian has been known to be shy to flower. The flowers are stemless and appear to sit on top of a carpet of leaves. This evergreen ground cover measures about 4 inches tall and 8 inches wide."
	},
	{
		"class": "artichoke",
		"description": "Artichoke flowers, specifically those of the globe artichoke (Cynara cardunculus var. scolymus), are large, thistle-like flower heads that develop at the end of sturdy stalks. If left unharvested, the unopened buds, which are the edible part, will bloom into beautiful, vibrant purple, blue, or pink flowers. These flowers are actually made up of many small florets clustered together on a fleshy receptacle"
	},
	{
		"class": "sweet william",
		"description": "Sweet William (Dianthus barbatus) is a flowering plant known for its vibrant, clustered blooms and bearded petals. It typically grows 12-24 inches tall with flat-topped clusters of small flowers in shades of red, pink, white, and bicolor, often with a contrasting eye. The flowers bloom from late spring to early summer and are known to attract hummingbirds. The leaves are lance-shaped and medium green. Sweet William is often grown as a biennial or short-lived perennial, sometimes treated as an annual"
	},
	{
		"class": "carnation",
		"description": "Carnations (Dianthus caryophyllus) are popular, long-stemmed flowers with a distinctive spicy, clove-like fragrance. They feature layered, ruffled petals, typically in shades of pink, red, white, yellow, or purple, and sometimes with stripes or picotee edges. Carnations are known for their durability and delicate appearance, making them a common choice for bouquets and floral arrangements"
	},
	{
		"class": "garden phlox",
		"description": "Garden phlox (Phlox paniculata) is a popular, upright, perennial plant known for its fragrant, long-blooming, and colorful flower clusters. It's a favorite in gardens for its vibrant display of pink, purple, white, red, or bi-color blooms, attracting butterflies and hummingbirds. Typically growing 2-4 feet tall, it thrives in full sun to part shade with well-drained soil, and is relatively low-maintenance"
	},
	{
		"class": "love in the mist",
		"description": "Nigella damascena, love-in-a-mist, or devil in the bush, is an annual garden flowering plant, belonging to the buttercup family Ranunculaceae. It is native to southern Europe (but adventive in more northern countries of Europe), north Africa and southwest Asia, where it is found on neglected, damp patches of land"
	},
	{
		"class": "mexican aster",
		"description": "Mexican Aster, also known as Cosmos bipinnatus, is an annual plant with feathery foliage and daisy-like flowers, typically in shades of pink, white, or red. Mexican Aster has slender, erect stems and finely divided, mid-green leaves that resemble dill foliage. The plant produces large, single, semi-double, or double daisy-like flowers, often with yellow centers"
	},
	{
		"class": "alpine sea holly",
		"description": "Eryngium alpinum is a hemicryptophyte, its overwintering buds are situated just below the soil surface and the floral axis more or less erect with a few leaves.[2] The roots are deep and robust. The stems are solitary and erect, usually with three branches on the apex and with longitudinal purple stripes. This plant generally reaches about 30–70 centimetres (12–28 in) in height,[2] with a maximum of 100 centimetres (39 in). The basal leaves are oval or heart-shaped, 10–15 centimetres (3.9–5.9 in) wide and 13–17 centimetres (5.1–6.7 in) long,[2] with toothed hedges and a long petiole. The cauline leaves are sessile and progressively more divided.[2] The inflorescences are dense umbels at the top of the main branches. They are bright green at the bases and the stiff, bristly bracts are blue. They are about 4 cm long and 2 cm diameter and the bracts are up to 25 centimetres (9.8 in) long.[2] The flowers inside are about 2 mm long. The peripheral flowers are sterile and the internal flowers are hermaphroditic. Both types are actinomorphic and pentamerous, with five petals. Flowering occurs in July through September.[2] The flowers are -insect-pollinated. The fruit is a spiny achene about half a centimeter wide"
	},
	{
		"class": "ruby-lipped cattleya",
		"description": "This plant grows in the northeastern area of Brazil, in the states of Pernambuco and Alagoas. They grow to different sizes depending on the area from which they originate. Those that are growing in Pernambuco are smaller, with small but colored flowers, with most of them being lilac. The interior part of the flower is a dark lilac color.[1] Plants from Alagoas are bigger and have larger flowers. Some varieties, such as Cattleya labiata var. semialba, have large white flowers with a touch of yellow. There is another variety of semialba, with lilac in the inferior part of the flower. This plant is an epiphyte, growing up in trees, where light is plentiful. However, there are also many other places where this plant could grow, such as directly on rock with very little soil. The plant itself is a medium-sized unifoliate (labiate) Cattleya, with a medium-sized rhizome. The plant has long leaves, with a tough (coriaceous) consistency because of the aridity in the canopy of trees, due to a short dry season. For water requirements, the plant has a pseudobulb under every leaf to store water and nutritive substances during the short dry season. In the wet season new leaves grow rapidly, producing a large flowered inflorescence. Flowers are white or lavender colored with a darker spot in the lip. Pollination is performed by insects, usually by a scent-collecting male euglossine bee. The result is a capsule with a very large number of seeds (10,000-20,000)."
	},
	{
		"class": "cape flower",
		"description": "Nerine bowdenii, commonly known as Bowden Lily or Guernsey Lily, produces striking, funnel-shaped flowers in shades of pink, sometimes with white, that bloom in the fall. The flowers, borne on leafless stems in clusters, have six narrow, wavy-edged, recurved petals and prominent stamens and anthers. The plant is a herbaceous, bulbous perennial, growing up to 2 feet tall with strap-shaped leaves that emerge after the flowers"
	},
	{
		"class": "great masterwort",
		"description": "Great masterwort (Astrantia major) is a herbaceous perennial known for its unique, pincushion-like flowerheads. These flowerheads, typically 2-3 inches in diameter, feature tiny, greenish-white flowers surrounded by a showy ruff of papery, petal-like bracts that can be white, pink, or green-tinged. The plant forms a clump of deeply divided, palmate leaves and blooms from late spring to early summer, with stems reaching up to 24 inches tall"
	},
	{
		"class": "siam tulip",
		"description": "Siam tulip, scientifically known as Curcuma alismatifolia, is a tropical plant in the ginger family, renowned for its stunning, tulip-like flowers. These flowers are actually petal-like bracts, which can be pink, purple, white, or even yellow, surrounding small, true flowers. Native to Thailand,it's a popular ornamental plant for gardens and indoor spaces due to its vibrant colors and long-lasting blooms"
	},
	{
		"class": "lenten rose",
		"description": "Lenten rose (Helleborus orientalis) is a late winter to early spring blooming perennial known for its nodding, cup-shaped flowers that resemble roses. These flowers come in a variety of colors, including white, pink, purple, and green, sometimes with interior spotting. The plant features evergreen, leathery, dark green leaves and can reach 1-1.5 feet in height"
	},
	{
		"class": "barbeton daisy",
		"description": "The Barberton daisy, scientifically known as Gerbera jamesonii, is a vibrant perennial flower native to South Africa. It's characterized by its large, daisy-like flower heads, which come in a variety of colors, including red, orange, yellow, and white. These flowers, typically around 4 inches in diameter, consist of a central disk of tiny florets surrounded by a ring of slender ray florets. The plant forms a basal rosette of spatulate, often lobed, dark green leaves"
	},
	{
		"class": "daffodil",
		"description": "Daffodils, members of the Narcissus genus, are iconic spring flowers known for their vibrant colors and distinctive trumpet-shaped corona. They typically feature six petal-like tepals (collectively known as the perianth) surrounding a central cup or trumpet (the corona), which can vary in size and shape. Most commonly yellow or white, daffodils also come in shades of orange and pink, sometimes with contrasting colors between the petals and corona. Their height can range from a few inches to over a foot"
	},
	{
		"class": "sword lily",
		"description": "The sword lily, also known as Gladiolus, is a genus of flowering plants known for their tall, sword-shaped leaves and striking, funnel-shaped flowers arranged on one-sided spikes. These plants are perennials, growing from corms (bulb-like structures) and are native to Africa, Europe, and the Mediterranean region. Their flowers come in a wide array of colors, including red, pink, purple, yellow, and white, and they bloom in succession from the bottom up"
	},
	{
		"class": "poinsettia",
		"description": "Poinsettias, scientifically known as Euphorbia pulcherrima, are known for their vibrant, colorful bracts (modified leaves) that resemble petals, often red, but also available in pink, white, and various other shades. These bracts surround the true flowers, which are small, yellow, and inconspicuous"
	},
	{
		"class": "bolero deep blue",
		"description": "The Bolero Deep Blue Lisianthus (also known as Texas Bluebell or Prairie Gentian) features semi-double, bell-shaped flowers with a deep blue-violet color. The flowers are typically 4.5-5 cm in diameter and 3-3.5 cm in length/height. The plant also has blue-green, lance-shaped leaves, which contrast nicely with the dark flowers. The overall effect is an elegant and sophisticated appearance"
	},
	{
		"class": "wallflower",
		"description": "Wallflowers, belonging to the genus Erysimum, are known for their vibrant, fragrant flowers and are popular in gardens for borders, beds, and containers. They are typically low-growing, mounding plants, with showy, long-blooming flowers in shades of yellow, orange, red, pink, and even purple. Many varieties are hardy perennials, offering evergreen foliage"
	},
	{
		"class": "marigold",
		"description": "Marigold flowers, belonging to the genus Tagetes, are vibrant annuals known for their bright yellow, orange, and red blossoms, and often have a strong, pungent scent. They come in various shapes and sizes, from small, daisy-like blooms to large, pom-pom shaped flowers"
	},
	{
		"class": "buttercup",
		"description": "Buttercups are known for their bright, shiny yellow (sometimes white or other colors) flowers with typically five petals, and their distinctive cup-like shape. They are generally small to medium-sized plants with slender, hairy stems and deeply lobed, dark green leaves"
	},
	{
		"class": "oxeye daisy",
		"description": "The Oxeye daisy (Leucanthemum vulgare) is a perennial plant with characteristic white, daisy-like flowers and a yellow central disc. It typically grows 1 to 3 feet tall and has long, toothed or lobed leaves that clasp the stem"
	},
	{
		"class": "common dandelion",
		"description": "They are an oblong shape with varying serrated edges. The flowers, which grow at the very top of each stem, are comprised of many small florets, which are a bright yellow in colour. When pollinated, numerous seeds form at the top of the stem."
	},
	{
		"class": "petunia",
		"description": "Petunias are vibrant, trumpet-shaped flowers known for their ability to add a pop of color to gardens, hanging baskets, and containers. They come in a wide range of colors, including pink, purple, red, white, yellow, and various bi-colored patterns. The flowers can be single or double, with ruffled or smooth edges, and vary in size. Petunias are relatively low-maintenance, preferring full sun and well-draining soil, and are popular for their prolific and long-lasting blooms"
	}
]
